# 2. Напишите программу, которая на вход принимает 5 чисел и находит максимальное из них.
#     Примеры:
#     - 1, 4, 8, 7, 5 -> 8
#     - 78, 55, 36, 90, 2 -> 90


# a = int(input('Введите число 1: '))
# b = int(input('Введите число 2: '))
# c = int(input('Введите число 3: '))
# d = int(input('Введите число 4: '))
# e = int(input('Введите число 5: '))

# max = -100000000
# for i in numbers:       # перебор элементов списка
#     if i > max:
#         max = i
# print('максимальное число из 5 введенных: ', max,)

#вариант решения замороченный
# max = -10000000
# list = []
# for i in range(5):
#     number = int(input(('Введите число' ,i,)))
#     list.append(number)
#     if number > max:
#         max = number
# print(max)


# d = {'a': 50, 'b': 150, 'c': 20}
# print(f"{d['a'] + d['b']}" + str(d['c']))

